src/cf/Documents/Больничные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Больничные</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БольничныеПериоды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>С</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>По</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБольничного</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Больничные/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаБольничного Из Объект.Сотрудники Цикл
		Если СтрокаБольничного.По < СтрокаБольничного.С Тогда
			Сообщить("Дата окончания больничного меньше даты начала у сотрудника "
				+ СтрокаБольничного.Сотрудник + ".");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = СформироватьПечатнуюФорму();
	ТабличныйДокумент.Показать("Печать: Больничные");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПечатнуюФорму()

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;

	// Шапка
	ТабличныйДокумент.Область("R1C1:R1C4").Объединить();
	ТабличныйДокумент.Область("R1C1").Текст =
		"Больничные № " + Объект.Номер + " от " + Формат(Объект.Дата, "ДЛФ=D");

	ТабличныйДокумент.Область("R3C1").Текст = "Сотрудник";
	ТабличныйДокумент.Область("R3C2").Текст = "С";
	ТабличныйДокумент.Область("R3C3").Текст = "По";
	ТабличныйДокумент.Область("R3C4").Текст = "Номер больничного";
	ТабличныйДокумент.Область("R3C1:R3C4").Обрамление =
		Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);

	НомерСтроки = 4;
	Для Каждого СтрокаБольничного Из Объект.Сотрудники Цикл
		ТабличныйДокумент.Область("R" + НомерСтроки + "C1").Текст =
			Строка(СтрокаБольничного.Сотрудник);
		ТабличныйДокумент.Область("R" + НомерСтроки + "C2").Текст =
			Формат(СтрокаБольничного.С, "ДЛФ=D");
		ТабличныйДокумент.Область("R" + НомерСтроки + "C3").Текст =
			Формат(СтрокаБольничного.По, "ДЛФ=D");
		ТабличныйДокумент.Область("R" + НомерСтроки + "C4").Текст =
			СтрокаБольничного.НомерБольничного;
		ТабличныйДокумент.Область("R" + НомерСтроки + "C1:R" + НомерСтроки + "C4").Обрамление =
			Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	Если Не ПустаяСтрока(Объект.Комментарий) Тогда
		НомерСтроки = НомерСтроки + 1;
		ТабличныйДокумент.Область("R" + НомерСтроки + "C1").Текст =
			"Комментарий: " + Объект.Комментарий;
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти
